# Parameter Type Id Plane Selection Param Property

Source: https://www.revitapidocs.com/2026/e839eb5d-2974-d430-81b4-7ddf75be223a.htm

---

| Parameter Type Id Plane Selection Param Property |
| --- |

"Host"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId PlaneSelectionParam { get; }
```

```
Public Shared ReadOnly Property PlaneSelectionParam As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ PlaneSelectionParam {
	ForgeTypeId^ get ();
}
```

```
static member PlaneSelectionParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace